package jp.co.oda32.batch.bcart;

/**
 * SmileOrderImportCsvのヘッダー定義
 *
 * @author k_oda
 * @since 2023/04/11
 */
public class SmileOrderImportCsvHeader {
    public static final String[] CSV_HEADERS = {
            "伝票日付", "伝票№", "処理連番", "明細区分", "行", "得意先コード", "得意先名１", "得意先名２", "納品先コード",
            "納品先名", "担当者コード", "請求区分", "売掛区分", "取引区分", "取引区分属性",
            "商品コード", "商品名", "入数", "個数", "個数単位", "数量", "数量単位", "単価", "金額", "原単価", "原価金額",
            "粗利", "単価掛率", "課税区分", "消費税率", "内消費税等", "行摘要コード", "行摘要１", "行摘要２", "備考コード", "備考",
            "受注№", "受注行", "見積処理連番", "見積行", "自動生成区分", "伝票消費税計算区分", "データ発生区分", "相手処理連番", "入力ﾊﾟﾀｰﾝ№",
            "伝票番号", "相手伝票番号", "コード", "コード", "社店コード", "分類コード", "伝票区分", "取引先コード", "売単価", "相手商品コード",
            "チェックマーク区分", "消費税分類"
    };
}
